; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v7)
             (pred_1 ?v12 ?v6)
             (pred_11 ?v5 ?v6)
             (pred_6 ?v8 ?v5 )
	     (pred_2 ?v5)
             (pred_12 ?v9)
             (pred_4 ?v12)
             (pred_5 ?v6)
             (pred_7 ?v5)
             (pred_3 ?v12)
             (pred_8 ?v5)
             (pred_10 ))



(:action op_2
:parameters (?v13 ?v10 ?v1 ?v11)
:precondition (and (pred_12 ?v13) (pred_12 ?v10) (pred_4 ?v1) (pred_5 ?v11)
          (pred_9 ?v13 ?v10) (pred_1 ?v1 ?v11)
                   (pred_11 ?v10 ?v11) (pred_2 ?v13) 
                   (pred_7 ?v10) (pred_3 ?v1))
:effect (and  (pred_8 ?v10) (not (pred_7 ?v10))))


(:action op_5
:parameters (?v13 ?v3)
:precondition (and (pred_12 ?v13) (pred_12 ?v3)
               (pred_2 ?v13) (pred_9 ?v13 ?v3) (pred_8 ?v3))
:effect (and (pred_2 ?v3) (not (pred_2 ?v13))))

(:action op_3
:parameters (?v13 ?v1)
:precondition (and (pred_12 ?v13) (pred_4 ?v1) 
                  (pred_2 ?v13) (pred_6 ?v1 ?v13) (pred_10 ))
:effect (and (pred_3 ?v1)
   (not (pred_6 ?v1 ?v13)) (not (pred_10 ))))


(:action op_4
:parameters (?v13 ?v4 ?v2)
:precondition (and (pred_12 ?v13) (pred_4 ?v4) (pred_4 ?v2)
                  (pred_2 ?v13) (pred_3 ?v2) (pred_6 ?v4 ?v13))
:effect (and (pred_3 ?v4) (pred_6 ?v2 ?v13)
        (not (pred_3 ?v2)) (not (pred_6 ?v4 ?v13))))

(:action op_1
:parameters (?v13 ?v1)
:precondition (and (pred_12 ?v13) (pred_4 ?v1) 
                  (pred_2 ?v13) (pred_3 ?v1))
:effect (and (pred_10 ) (pred_6 ?v1 ?v13) (not (pred_3 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_30 obj_03 obj_29 obj_19 obj_16 obj_12 obj_27 obj_32 obj_25 obj_02 obj_21 obj_26 obj_15 obj_17 obj_07 obj_11 obj_28 obj_31 obj_10 obj_01 obj_23 obj_24 obj_13 obj_09 obj_04
    obj_18 obj_06 obj_20
    obj_22 obj_14 obj_08 obj_05
    )

    (:init
       (pred_10)

       (pred_12 obj_30)
       (pred_12 obj_03)
       (pred_12 obj_29)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_12)
       (pred_12 obj_27)
       (pred_12 obj_32)
       (pred_12 obj_25)
       (pred_12 obj_02)
       (pred_12 obj_21)
       (pred_12 obj_26)
       (pred_12 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_07)
       (pred_12 obj_11)
       (pred_12 obj_28)
       (pred_12 obj_31)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_23)
       (pred_12 obj_24)
       (pred_12 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_20)
       (pred_4 obj_22)
       (pred_4 obj_14)
       (pred_4 obj_08)
       (pred_4 obj_05)

       (pred_9 obj_30 obj_12)
       (pred_9 obj_30 obj_03)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_03 obj_29)
       (pred_9 obj_03 obj_30)
       (pred_9 obj_29 obj_32)
       (pred_9 obj_29 obj_19)
       (pred_9 obj_29 obj_03)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_29)
       (pred_9 obj_16 obj_02)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_12 obj_21)
       (pred_9 obj_12 obj_27)
       (pred_9 obj_12 obj_30)
       (pred_9 obj_27 obj_26)
       (pred_9 obj_27 obj_32)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_12)
       (pred_9 obj_32 obj_15)
       (pred_9 obj_32 obj_25)
       (pred_9 obj_32 obj_29)
       (pred_9 obj_32 obj_27)
       (pred_9 obj_25 obj_17)
       (pred_9 obj_25 obj_02)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_32)
       (pred_9 obj_02 obj_07)
       (pred_9 obj_02 obj_16)
       (pred_9 obj_02 obj_25)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_21 obj_26)
       (pred_9 obj_21 obj_12)
       (pred_9 obj_26 obj_28)
       (pred_9 obj_26 obj_15)
       (pred_9 obj_26 obj_27)
       (pred_9 obj_26 obj_21)
       (pred_9 obj_15 obj_31)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_32)
       (pred_9 obj_15 obj_26)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_25)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_07 obj_02)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_11 obj_28)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_28 obj_24)
       (pred_9 obj_28 obj_31)
       (pred_9 obj_28 obj_26)
       (pred_9 obj_28 obj_11)
       (pred_9 obj_31 obj_13)
       (pred_9 obj_31 obj_10)
       (pred_9 obj_31 obj_15)
       (pred_9 obj_31 obj_28)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_10 obj_31)
       (pred_9 obj_01 obj_04)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_23 obj_24)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_24 obj_13)
       (pred_9 obj_24 obj_28)
       (pred_9 obj_24 obj_23)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_13 obj_31)
       (pred_9 obj_13 obj_24)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_04 obj_09)
       (pred_7 obj_28)
       (pred_7 obj_27)
       (pred_7 obj_24)
       (pred_7 obj_13)
       (pred_11  obj_28 obj_18)
       (pred_11  obj_27 obj_06)
       (pred_11  obj_24 obj_20)
       (pred_11  obj_13 obj_20)
       (pred_8 obj_30)
       (pred_8 obj_03)
       (pred_8 obj_29)
       (pred_8 obj_19)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_32)
       (pred_8 obj_25)
       (pred_8 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_26)
       (pred_8 obj_15)
       (pred_8 obj_17)
       (pred_8 obj_07)
       (pred_8 obj_11)
       (pred_8 obj_31)
       (pred_8 obj_10)
       (pred_8 obj_01)
       (pred_8 obj_23)
       (pred_8 obj_09)
       (pred_8 obj_04)

       (pred_1  obj_22 obj_18)
       (pred_1  obj_14 obj_06)
       (pred_1  obj_08 obj_20)
       (pred_1  obj_05 obj_06)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_14 obj_32)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_05 obj_09)
       (pred_2 obj_10)
    )

    (:goal (and
       (pred_6 obj_22 obj_19)
       (pred_6 obj_14 obj_29)
    ))
(:constraints
  (always (not (pred_2 obj_17)))
)
)

; plan
1. (op_5 obj_10 obj_31)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_31)
   goals met: 0 of 2
2. (op_5 obj_31 obj_15)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_15)
   goals met: 0 of 2
3. (op_5 obj_15 obj_32)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_32)
   goals met: 0 of 2
4. (op_3 obj_32 obj_14)
   deleted: (pred_6 obj_14 obj_32) (pred_10)
   added: (pred_3 obj_14)
   goals met: 0 of 2
5. (op_5 obj_32 obj_29)
   deleted: (pred_2 obj_32)
   added: (pred_2 obj_29)
   goals met: 0 of 2
6. (op_1 obj_29 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_10) (pred_6 obj_14 obj_29)
   goals met: 1 of 2
7. (op_5 obj_29 obj_19)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_19)
   goals met: 1 of 2
8. (op_5 obj_19 obj_16)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_16)
   goals met: 1 of 2
9. (op_5 obj_16 obj_02)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_02)
   goals met: 1 of 2
10. (op_5 obj_02 obj_07)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_07)
   goals met: 1 of 2
11. (op_3 obj_07 obj_22)
   deleted: (pred_6 obj_22 obj_07) (pred_10)
   added: (pred_3 obj_22)
   goals met: 1 of 2
12. (op_5 obj_07 obj_02)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_02)
   goals met: 1 of 2
13. (op_5 obj_02 obj_16)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_16)
   goals met: 1 of 2
14. (op_5 obj_16 obj_19)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_19)
   goals met: 1 of 2
15. (op_1 obj_19 obj_22)
   deleted: (pred_3 obj_22)
   added: (pred_10) (pred_6 obj_22 obj_19)
   goals met: 2 of 2
